[{"keywords":[],"description":"","key":"amendment","label":"Amendment","count":0,"topics":[{"keywords":[],"description":"Details the way in which the text of the constitution can be formally amended. This is distinct from the task of constitutional interpretation often undertaken by courts.","key":"amend","label":"Constitution amendment procedure","count":0,"topics":[]},{"keywords":["inalienable","inviolable","derogable"],"description":"Some provisions in the constitutions may be so fundamental to the constitutional order, or so politically contentious, that they are designated as unamendable. In such cases, unamendable provisions are expressly noted in the constitution.","key":"unamend","label":"Unamendable provisions","count":0,"topics":[]},{"keywords":["constituent assembly"],"description":"Provides a procedure for calling a constitutional convention or for replacing the entire constitution.","key":"replace","label":"Constitutional convention or replacement","count":0,"topics":[]},{"keywords":[],"description":"Provisions to repeal or amend, in whole or in part, previous amendments to the constitution.","key":"repeal","label":"Repeal of previous amendment(s)","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"culture-and-identity","label":"Culture and Identity","count":0,"topics":[{"keywords":[],"description":"","key":"culture-and-identity_citizenship","label":"Citizenship","count":0,"topics":[{"keywords":[],"description":"In extraordinary circumstances, usually relating to criminal convictions abroad, some constitutions give the government the power to deport citizens. In other constitutions, the government is specifically prohibited from deporting citizens but allows deportation of other residents.","key":"citdep","label":"Power to deport citizens","count":0,"topics":[]},{"keywords":["nationals","subjects"],"description":"Details the requirements for an individual to be granted citizenship at birth. The requirements may relate to the citizenship or residency of one or both parents, or to the location of an individual's birth.","key":"citizen","label":"Requirements for birthright citizenship","count":0,"topics":[]},{"keywords":["nationals","subjects"],"description":"Grants individuals the right to renounce their citizenship. This right is sometimes subject to qualifications relating to dual-citizenship, or the existence of a state of war.","key":"citren","label":"Right to renounce citizenship","count":0,"topics":[]},{"keywords":["nationals","subjects"],"description":"Describes the conditions under which a government is allowed to revoke an individual's citizenship. Some constitutions expressly forbid the government from revoking citizenship, regardless of the circumstances.","key":"citrev","label":"Conditions for revoking citizenship","count":0,"topics":[]},{"keywords":["nationals","subjects"],"description":"Naturalization is the process through which a person acquires a citizenship to which they did not have a right by birth. These provisions detail the requirements an individual must fulfil in order to gain citizenship.","key":"natcit","label":"Requirements for naturalization","count":0,"topics":[]},{"keywords":["nationals","subjects"],"description":"Primarily concerned with the movements of foreign nationals, describes the powers of the government to restrict entry into or exit out of the state.","key":"resenex","label":"Restrictions on entry or exit","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their nationality. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr2","label":"Equality regardless of nationality","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their country or place of origin. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr3","label":"Equality regardless of origin","count":0,"topics":[]},{"keywords":[],"description":"Clarifies the citizenship status of members of indigenous groups. In some cases indigenous groups may be granted citizenship in a sub-national unit.","key":"indcit","label":"Citizenship of indigenous groups","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"culture-and-identity_indigenous-groups","label":"Indigenous Groups","count":0,"topics":[{"keywords":[],"description":"Clarifies the citizenship status of members of indigenous groups. In some cases indigenous groups may be granted citizenship in a sub-national unit.","key":"indcit","label":"Citizenship of indigenous groups","count":0,"topics":[]},{"keywords":["suffrage","native","aboriginal"],"description":"Specifically grants indigenous peoples the right to vote in national elections or referenda.","key":"indpolgr1","label":"Indigenous right to vote","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to representation in the central government. This might, for example, involve a seat quota in the legislature.","key":"indpolgr2","label":"Indigenous right to representation","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to form political parties on the basis of group identity.","key":"indpolgr3","label":"Indigenous right to political parties","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples an exemption from taxation by the central government.","key":"indpolgr4","label":"Indigenous right not to pay taxes","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to take part in activities that are illegal for the non-indigenous population.","key":"indpolgr5","label":"Indigenous right to illegal activities","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples limited rights to self-government, particularly with regard to issues that affect their territory.","key":"indpolgr6","label":"Indigenous right to self governance","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"","key":"indrghts","label":"Indigenous rights","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"culture-and-identity_language","label":"Language","count":0,"topics":[{"keywords":[],"description":"Establishes the official languages of the state. Official languages are those used for interactions with state agencies. National languages are often local languages, while the official languages of the state sometimes include the language of a former colonial power.","key":"lang","label":"Official or national languages","count":0,"topics":[]},{"keywords":["culture"],"description":"Protects the right of individuals to use their native language, or otherwise provides general protections for particular languages. Protected languages may be specified, but remain distinct from the official languages of the state.","key":"langprot","label":"Protection of language use","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Grants individuals charged with an offense the right to have their trial conducted in a language they understand, or the right to have an interpreter. In some cases, this would include a right to be informed of the reasons for one’s arrest.","key":"trilang","label":"Trial in native language of accused","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","race","ethnicity"],"description":"Requires that everyone is treated equally before the law, without regard to their language. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr5","label":"Equality regardless of language","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"culture-and-identity_race-and-ethnicity","label":"Race and Ethnicity","count":0,"topics":[{"keywords":["culture"],"description":"Minority ethnic communities are enabled to participate in the affairs of the state or society. Some constitutions offer additional protection against forced assimilation.","key":"ethincl","label":"Integration of ethnic communities","count":0,"topics":[]},{"keywords":["culture"],"description":"The state is required to provide additional resources, either in monetary contributions or in services, to specific groups within the society. Categories might include gender, ethnicity, disability, or any other group identity.","key":"opgroup","label":"Provisions for wealth distribution","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their tribe or clan. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr14","label":"Equality regardless of tribe or clan","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","race","ethnicity"],"description":"Requires that everyone is treated equally before the law, without regard to their race. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr4","label":"Equality regardless of race","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"culture-and-identity_religion","label":"Religion","count":0,"topics":[{"keywords":["church","secular"],"description":"An invocation of the divine. Often found in the preamble, particularly in states with an established religion.","key":"god","label":"God or other deities","count":0,"topics":[]},{"keywords":["church","secular","state religion","national religion"],"description":"Establishment of an official religion, or religions, for the state. Other constitutions provide special treatment for certain religions, or conversely, expressly forbid the state from establishing an official religion.","key":"offrel","label":"Official religion","count":0,"topics":[]},{"keywords":["church","secular","repugnancy clause"],"description":"Religious law and constitutional law interact in complex ways. Constitutions can treat religious law as entirely separate, integrated to some degree, applied in areas where secular law is silent, considered superior, or used as a source or inspiration for secular law.","key":"rellaw","label":"Status of religious law","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Religious organizations are granted a special status with regard to taxation. This may include exemptions from regular taxation of income or property.","key":"reltax","label":"Tax status of religious organizations","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Guarantees separation between the state and religious organizations. The state may be forbidden from extending governmental recognition or assistance to religious organizations.","key":"seprel","label":"Separation of church and state","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Courts with limited jurisdiction to adjudicate matters arising in religious law. Jurisdiction may be limited on a confessional basis.","key":"judcrts8","label":"Establishment of religious courts","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Grants individuals the right to hold religious beliefs, and to freely practice those religious beliefs. This right is also commonly understood to include the right to change one's religion, or to have no religion at all.","key":"freerel","label":"Freedom of religion","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","religion","church","secular"],"description":"Requires that everyone is treated equally before the law, without regard to their creed, belief, or opinions. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr11","label":"Equality regardless of creed or belief","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","church","secular"],"description":"Requires that everyone is treated equally before the law, without regard to their religion. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr6","label":"Equality regardless of religion","count":0,"topics":[]},{"keywords":["church","secular","establishment clause","public funding"],"description":"Allows for government funding of religious institutions, including churches and K-12 schools.","key":"relsup","label":"Public support for religion/religious institutions","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"elections","label":"Elections","count":0,"topics":[{"keywords":[],"description":"","key":"elections_electoral-oversight","label":"Electoral Oversight","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in an electoral court. In some cases may also provide a maximum age.","key":"ecage","label":"Age restrictions on electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the electoral court. In addition to hearing challenges of election results, the court may be responsible for certifying various aspects of elections, including voter rolls and final vote tallies.","key":"ecpow","label":"Electoral court powers","count":0,"topics":[]},{"keywords":[],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"ecrdet","label":"Electoral court removal","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge in an electoral court. These often concern educational and professional credentials.","key":"ecres","label":"Eligibility for electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for an electoral court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"ecsel","label":"Electoral court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that an electoral judge serves before either reappointment or dismissal is required.","key":"ecterm","label":"Electoral court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in an electoral court.","key":"ecterml","label":"Electoral court term limits","count":0,"topics":[]},{"keywords":[],"description":"An independent commission responsible for facilitating and regulating elections. May be responsible for monitoring political parties and the financing of elections.","key":"ecom","label":"Electoral commission","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"elections_electoral-rules-and-regulations","label":"Electoral Rules and Regulations","count":0,"topics":[{"keywords":["voting"],"description":"Rules that political parties and candidates must follow in financing electoral campaigns. Some constitutions establish government assistance for such purposes, or forbid receipt of funds from certain other sources.","key":"camppubf","label":"Campaign financing","count":0,"topics":[]},{"keywords":[],"description":"Provides for the enumeration of residents periodically. Additional instructions about the conduct of the census may also be given.","key":"census","label":"Census","count":0,"topics":[]},{"keywords":["voting"],"description":"Describes characteristics, or rules for the establishment, of electoral districts. Constitutions rarely directly establish the districts, but rather describe where and how these decisions will be made.","key":"district","label":"Electoral districts","count":0,"topics":[]},{"keywords":["voting"],"description":"When elections shall be held. This could be described in terms of a particular day, an interval between elections, or with relation to the dismissal of the legislature or executive.","key":"electsch","label":"Scheduling of elections","count":0,"topics":[]},{"keywords":["voting"],"description":"Voting takes place in such a way that a citizen completes the ballot privately, and the ballot cannot be connected to the voter.","key":"freeelec","label":"Secret ballot","count":0,"topics":[]},{"keywords":[],"description":"","key":"ballots","label":"Ballot access and structure","count":0,"topics":[]},{"keywords":[],"description":"Provides voters with the ability to recall some or all elected officials. May include specific recall procedures or specify particular offices for which recalls can be used.","key":"recall","label":"Provision to recall elected officials","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"elections_political-parties","label":"Political Parties","count":0,"topics":[{"keywords":[],"description":"A particular political party, or type of party, has a special status within the state.","key":"partprf","label":"Preferred political parties","count":0,"topics":[]},{"keywords":[],"description":"Certain political parties, or parties with particular ideologies or characteristics, are prohibited. For example, some constitutions prohibit parties that are founded on a tribal or group identity.","key":"partprh","label":"Prohibited political parties","count":0,"topics":[]},{"keywords":[],"description":"Establishes the boundaries of acceptable activity, or the organizational structure, of political parties. For example, parties may be bound to respect some fundamental principles of the state.","key":"partreg","label":"Restrictions on political parties","count":0,"topics":[]},{"keywords":[],"description":"Establishes the right to join a party or other political organization, or gives citizens the right to form new political parties.","key":"partrght","label":"Right to form political parties","count":0,"topics":[]},{"keywords":[],"description":"Describes which branch or body of the government has the power to regulate political parties, particularly those tasked with determining the unconstitutionality of certain parties.","key":"partunco","label":"Regulation of political parties","count":0,"topics":[]},{"keywords":[],"description":"Requires all citizens to be a member of a political party, or of the sole political party of the state.","key":"prtyduty","label":"Duty to join a political party","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination"],"description":"Requires that everyone is treated equally before the law, without regard to their political party membership or political opinions. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr15","label":"Equality regardless of political party","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to form political parties on the basis of group identity.","key":"indpolgr3","label":"Indigenous right to political parties","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"elections_referenda-and-initiatives","label":"Referenda and Initiatives","count":0,"topics":[{"keywords":["voting"],"description":"Allows private citizens to propose new legislation. Usually this requires additional qualifications, such as support from a political party, a member of the legislature, or a certain number of signatures from other citizens.","key":"initiat","label":"Legislative initiatives by citizens","count":0,"topics":[]},{"keywords":["voting"],"description":"Provides citizens an opportunity to vote for or against a specific piece of proposed legislation. Referenda are proposed by one or more bodies of the government.","key":"referen","label":"Referenda","count":0,"topics":[]},{"keywords":[],"description":"Provides voters with the ability to recall some or all elected officials. May include specific recall procedures or specify particular offices for which recalls can be used.","key":"recall","label":"Provision to recall elected officials","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"elections_suffrage-and-turnout","label":"Suffrage and Turnout","count":0,"topics":[{"keywords":["voting","suffrage"],"description":"Makes voting mandatory for at least some electors in some elections. This is sometimes qualified on the basis of age, for example after age eighteen, or until age 70.","key":"compvote","label":"Compulsory voting","count":0,"topics":[]},{"keywords":["voting","suffrage","age"],"description":"Even where voting is considered to be a universal right, there may be some qualifications. For example, restrictions on the basis of residency, age, or criminal convictions are common.","key":"voteres","label":"Restrictions on voting","count":0,"topics":[]},{"keywords":["voting"],"description":"The right to vote is held by all citizens. There may nevertheless be some restrictions on voting by residency, age, residency or criminal conviction.","key":"voteun","label":"Claim of universal suffrage","count":0,"topics":[]},{"keywords":["suffrage","native","aboriginal"],"description":"Specifically grants indigenous peoples the right to vote in national elections or referenda.","key":"indpolgr1","label":"Indigenous right to vote","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"executive","label":"Executive","count":0,"topics":[{"keywords":[],"description":"","key":"executive_cabinet","label":"Cabinet","count":0,"topics":[{"keywords":["ministers","government"],"description":"Cabinet members generally serve at the pleasure of the appointing power, typically the executive. Many constitutions also allow the legislative branch to remove cabinet members in cases of misconduct.","key":"cabdiss","label":"Cabinet removal","count":0,"topics":[]},{"keywords":["ministers","government"],"description":"Matters on which the executive’s ministers have the power to act. These powers are often expressed in very general terms, but in some cases additional powers are enumerated for exercise in particular contexts.","key":"cabpow","label":"Powers of cabinet","count":0,"topics":[]},{"keywords":["ministers","government","age"],"description":"Qualifications that an individual must meet in order to serve in the cabinet. This is sometimes as simple as eligibility to vote, but may include a number of requirements. Ministers may also be restricted from serving as legislators.","key":"cabrest","label":"Eligibility for cabinet","count":0,"topics":[]},{"keywords":["ministers","government"],"description":"Establishes the bodies competent to nominate and approve members of the cabinet. Appointment is usually made by the executive branch, and is in some cases subject to approval by the legislative branch.","key":"cabsel","label":"Cabinet selection","count":0,"topics":[]},{"keywords":["ministers","government"],"description":"The body of high ranking officials who act as the heads of government departments and advise the head of state or head of government.","key":"cabinet","label":"Establishment of cabinet/ministers","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"executive_executive-independence-and-power","label":"Executive Independence and Power","count":0,"topics":[{"keywords":["ministers","government"],"description":"Cabinet members generally serve at the pleasure of the appointing power, typically the executive. Many constitutions also allow the legislative branch to remove cabinet members in cases of misconduct.","key":"cabdiss","label":"Cabinet removal","count":0,"topics":[]},{"keywords":["ministers","government"],"description":"Matters on which the executive’s ministers have the power to act. These powers are often expressed in very general terms, but in some cases additional powers are enumerated for exercise in particular contexts.","key":"cabpow","label":"Powers of cabinet","count":0,"topics":[]},{"keywords":["ministers","government","age"],"description":"Qualifications that an individual must meet in order to serve in the cabinet. This is sometimes as simple as eligibility to vote, but may include a number of requirements. Ministers may also be restricted from serving as legislators.","key":"cabrest","label":"Eligibility for cabinet","count":0,"topics":[]},{"keywords":[],"description":"Closely related to the idea of separation of powers, this is a constitutional guarantee of the independence of the executive.","key":"execindp","label":"Claim of executive independence","count":0,"topics":[]},{"keywords":[],"description":"Gives a body within the executive branch the authority to overrule a criminal conviction.\n","key":"pardon","label":"Power to pardon","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Allows the head of government, or exceptionally the cabinet, to enact rules without following the usual channels for the passage of legislation. This power is usually limited to particular circumstances or areas of government activity.","key":"hogdec","label":"Head of government decree power","count":0,"topics":[]},{"keywords":["prime minister"],"description":"In cases where the head of government has committed a crime, or lost the confidence of the legislature, he or she may be removed from office. This may be carried out by the legislature, the head of state, or another competent body.","key":"hogdiss","label":"Head of government removal","count":0,"topics":[]},{"keywords":["prime minister","dismissal"],"description":"Protections from removal for the head of government. For example, a failed attempt to remove the head of government may preclude additional votes on the matter for a specified period of time.","key":"hogdlim","label":"Limits on removing head of government","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Protection, whether absolute or limited, against prosecution for the head of government. This may involve protection against prosecution for certain kinds of crimes, or for a specified period of time.","key":"hogimm","label":"Head of government immunity","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Specific, enumerated powers that are given to the head of government. For example, some heads of government are given the power to issue currency, grant asylum, award decorations, or various other particular powers.","key":"hogpow","label":"Head of government powers","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Allows the head of state to enact rules without following the usual channels for the passage of legislation. This power is usually limited to particular circumstances or areas of government activity.","key":"hosdec","label":"Head of state decree power","count":0,"topics":[]},{"keywords":["president","king","queen","monarch","dismissal"],"description":"In cases where the head of state has committed a crime, or lost the confidence of the legislature, he or she may be removed from office. This may be carried out by the legislature, the head of government, or another competent body.","key":"hosdiss","label":"Head of state removal","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Specific, enumerated powers that are given to the head of state. For example, some heads of state are given the power to issue currency, grant asylum, award decorations, or various other particular powers.","key":"hospow","label":"Head of state powers","count":0,"topics":[]},{"keywords":[],"description":"Establishes ultimate control of the state's armed forces. Usually the head of state or head of government. This may be a ceremonial role, or may involve significant decision-making power.","key":"comchief","label":"Designation of commander in chief","count":0,"topics":[]},{"keywords":[],"description":"Mechanisms that allow the legislative branch to ensure that executive agencies are enforcing the laws according to the intent of the legislature. Also provides a check on the misuse or abuse of executive power.","key":"invexe","label":"Legislative oversight of the executive","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"executive_head-of-government","label":"Head of Government","count":0,"topics":[{"keywords":["prime minister"],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of head of government. In some cases may also provide a maximum age.","key":"hogage","label":"Age restrictions on head of government","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Allows the head of government, or exceptionally the cabinet, to enact rules without following the usual channels for the passage of legislation. This power is usually limited to particular circumstances or areas of government activity.","key":"hogdec","label":"Head of government decree power","count":0,"topics":[]},{"keywords":["prime minister"],"description":"In cases where the head of government has committed a crime, or lost the confidence of the legislature, he or she may be removed from office. This may be carried out by the legislature, the head of state, or another competent body.","key":"hogdiss","label":"Head of government removal","count":0,"topics":[]},{"keywords":["prime minister","dismissal"],"description":"Protections from removal for the head of government. For example, a failed attempt to remove the head of government may preclude additional votes on the matter for a specified period of time.","key":"hogdlim","label":"Limits on removing head of government","count":0,"topics":[]},{"keywords":["prime minister"],"description":"The procedure through which a candidate for the office of head of government is nominated and approved. This typically involves approval from both the legislature and the head of state.","key":"hogelect","label":"Head of government selection","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Protection, whether absolute or limited, against prosecution for the head of government. This may involve protection against prosecution for certain kinds of crimes, or for a specified period of time.","key":"hogimm","label":"Head of government immunity","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Establishes whether the head of government is required to serve, or is prohibited from serving, as a member of the legislature.","key":"hoglegr","label":"Head of government's role in the legislature","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Specific, enumerated powers that are given to the head of government. For example, some heads of government are given the power to issue currency, grant asylum, award decorations, or various other particular powers.","key":"hogpow","label":"Head of government powers","count":0,"topics":[]},{"keywords":["prime minister"],"description":"Qualifications that an individual must meet in order to serve as the head of government. This is sometimes as simple as eligibility to vote, but may include a number of requirements.","key":"hogrest","label":"Eligibility for head of government","count":0,"topics":[]},{"keywords":["prime minister"],"description":"The procedure by which the head of government is replaced in the event that he or she does not complete his or her term. This might involve a predetermined succession, or reversion to the normal selection procedure.","key":"hogsucc","label":"Head of government replacement","count":0,"topics":[]},{"keywords":["prime minister"],"description":"The number of years that a head of government serves before either reappointment or dismissal is required.","key":"hogterm","label":"Head of government term length","count":0,"topics":[]},{"keywords":["prime minister"],"description":"The number of terms, either consecutive or in total, that an individual may serve in the office of head of government.","key":"hogterml","label":"Head of government term limits","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"executive_head-of-state","label":"Head of State","count":0,"topics":[{"keywords":["president","king","queen","monarch"],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of head of state. In some cases may also provide a maximum age.","key":"hosage","label":"Age restrictions on head of state","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Allows the head of state to enact rules without following the usual channels for the passage of legislation. This power is usually limited to particular circumstances or areas of government activity.","key":"hosdec","label":"Head of state decree power","count":0,"topics":[]},{"keywords":["president","king","queen","monarch","dismissal"],"description":"In cases where the head of state has committed a crime, or lost the confidence of the legislature, he or she may be removed from office. This may be carried out by the legislature, the head of government, or another competent body.","key":"hosdiss","label":"Head of state removal","count":0,"topics":[]},{"keywords":["president","king","queen","monarch","electoral college"],"description":"The procedure through which a candidate for the office of head of state is nominated and approved. While there is great variation, common procedures include heredity, direct election, or election by the legislature.","key":"hoselect","label":"Head of state selection","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Protection, whether absolute or limited, against prosecution for the head of state. This may involve protection against prosecution for certain kinds of crimes, or for a specified period of time.","key":"hosimm","label":"Head of state immunity","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Specific, enumerated powers that are given to the head of state. For example, some heads of state are given the power to issue currency, grant asylum, award decorations, or various other particular powers.","key":"hospow","label":"Head of state powers","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"Qualifications that an individual must meet in order to serve as the head of state. This is sometimes as simple as eligibility to vote, but may include a number of requirements.","key":"hosrest","label":"Eligibility for head of state","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"In addition to a cabinet, other councils of high ranking officials may advise the head of state. This could include a privy council to a monarch, for example. Some advisory bodies may consult on specific topics, such as national security.","key":"hosstaff","label":"Advisory bodies to the head of state","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"The procedure by which the head of state is replaced in the event that he or she does not complete his or her term. This might involve a predetermined succession, or reversion to the normal selection procedure.","key":"hossucc","label":"Head of state replacement","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"The number of years that a head of state serves before either reappointment or dismissal is required.","key":"hosterm","label":"Head of state term length","count":0,"topics":[]},{"keywords":["president","king","queen","monarch"],"description":"The number of terms, either consecutive or in total, that an individual may serve in the office of head of state","key":"hosterml","label":"Head of state term limits","count":0,"topics":[]},{"keywords":[],"description":"Provides for the temporary replacement of the head of state, in cases of inability or other provisional circumstances.","key":"hostemp","label":"Temporary replacement of head of state","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"executive_military","label":"Military","count":0,"topics":[{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as the minister of defense. Particularly concerned with whether the minister is required to be, or prohibited from being, a member of the military.","key":"civilmil","label":"Restrictions on minister of defense","count":0,"topics":[]},{"keywords":[],"description":"Establishes ultimate control of the state's armed forces. Usually the head of state or head of government. This may be a ceremonial role, or may involve significant decision-making power.","key":"comchief","label":"Designation of commander in chief","count":0,"topics":[]},{"keywords":["state of seige","martial law","war","inviolable","inalienable","derogable"],"description":"Allows the government to declare an exceptional state, such as emergency, siege, or martial law. Usually gives the government additional powers, and may suspend some normal functions of the political system.","key":"em","label":"Emergency provisions","count":0,"topics":[]},{"keywords":[],"description":"The selection process for the highest ranking officers in the military. This often involves appointment by the head of the executive branch, and in some cases also requires the approval of at least part of the legislature.","key":"milcom","label":"Selection of active-duty commanders","count":0,"topics":[]},{"keywords":[],"description":"Limitations either on the government's use of the military, or on the actions of members of the military. For example, prohibition of domestic deployment of the military, or restrictions on the political rights of military officers.","key":"milrest","label":"Restrictions on the armed forces","count":0,"topics":[]},{"keywords":[],"description":"Terrorism specifically mentioned, usually in the context of the criminal justice system, or with regard to the activities of the military or other public safety bodies.","key":"terror","label":"Terrorism","count":0,"topics":[]},{"keywords":[],"description":"The process that the government must follow in order to establish a declaration of war. For example, this could be a power of the head of state, of the cabinet as a whole, or it could require consent from the legislative branch.","key":"war","label":"Power to declare/approve war","count":0,"topics":[]},{"keywords":[],"description":"Courts with jurisdiction limited to charges against members of the military, and tasked with enforcing military law.","key":"judcrts4","label":"Establishment of military courts","count":0,"topics":[]},{"keywords":[],"description":"A duty to serve a specified period of time in the country's military. Often also includes protections for conscientious objectors.","key":"milserv","label":"Duty to serve in the military","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"executive_structure-of-the-executive","label":"Structure of the Executive","count":0,"topics":[{"keywords":["prosecutor","public prosecutor","prosecutor general"],"description":"The office responsible for representing the government in criminal or civil cases. The office may have various names, including the public prosecutor, or prosecutor general.","key":"atgen","label":"Attorney general","count":0,"topics":[]},{"keywords":["ministers","government"],"description":"The body of high ranking officials who act as the heads of government departments and advise the head of state or head of government.","key":"cabinet","label":"Establishment of cabinet/ministers","count":0,"topics":[]},{"keywords":["vice president","deputy prime minister"],"description":"Specification of the deputy to the head of state or head of government. The deputy executive typically has the power to act when the executive is absent or becomes incapable of holding office.","key":"depexec","label":"Deputy executive","count":0,"topics":[]},{"keywords":["president","king","queen","monarch","prime minister"],"description":"Distinguishes the structure of the executive. Establishes the offices of head of state and/or head of government.","key":"execnum","label":"Name/structure of executive(s)","count":0,"topics":[]},{"keywords":["at large"],"description":"Establishes honorary positions for retired public officials, such as positions in the legislature for former presidents.","key":"honorary","label":"Honorary positions for retired office holders","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"federalism","label":"Federalism","count":0,"topics":[{"keywords":[],"description":"","key":"federalism_lawmaking-power","label":"Lawmaking Power","count":0,"topics":[{"keywords":[],"description":"In federal countries, the power of the federal government to review legislation passed by the governments of the subnational units. Such review could be undertaken by a federal court or another part of the federal government.","key":"fedrev","label":"Federal review of subnational legislation","count":0,"topics":[]},{"keywords":[],"description":"Establishes which level of government has supremacy on certain legislative matters or in cases where their laws are in conflict.","key":"fedsep","label":"National vs subnational legislation","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"federalism_secession-and-accession","label":"Secession and Accession","count":0,"topics":[{"keywords":["protectorates","territories","colonies","independence"],"description":"Allows the state to incorporate new territory into the country. Usually also specifies the necessary steps for this to happen.","key":"access","label":"Accession of territory","count":0,"topics":[]},{"keywords":["protectorates","territories","colonies","independence"],"description":"Addresses secession or withdrawal of groups or territories of the state. In cases where secession is allowed, usually also specifies the legal process that must take place.","key":"seccess","label":"Secession of territory","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"federalism_structure-of-the-state","label":"Structure of the State","count":0,"topics":[{"keywords":["local government","counties","districts"],"description":"Establishes the organs of municipal or local government, and their competencies.","key":"mun","label":"Municipal government","count":0,"topics":[]},{"keywords":["states","departments","regions","provinces","districts"],"description":"Specifies the competencies of the governments of the subsidiary units in a federal system.","key":"sub","label":"Subsidiary unit government","count":0,"topics":[]},{"keywords":["dc","federal district"],"description":"","key":"capdist","label":"Special district for the national capitol","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"international-law","label":"International Law","count":0,"topics":[{"keywords":[],"description":"","key":"international-law_administrative-courts","label":"Administrative Courts","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in an administrative court. In some cases may also provide a maximum age.","key":"adage","label":"Age restrictions on administrative judges","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"international-law_explicit-references-to-int-law","label":"Explicit References to Int. Law","count":0,"topics":[{"keywords":[],"description":"Reference to customary international law, the law of nations, or the generally accepted principles of international law.","key":"custlaw","label":"Customary international law","count":0,"topics":[]},{"keywords":[],"description":"Reference to international law, including treaties, agreements, norms, or other commitments.","key":"intlaw","label":"International law","count":0,"topics":[]},{"keywords":[],"description":"Reference to international organizations, whether generally or with regard to specific international organizations such as the United Nations.","key":"intorgs","label":"International organizations","count":0,"topics":[]},{"keywords":[],"description":"Reference to one or more specific international treaties or instruments concerning human rights.","key":"intrght","label":"International human rights treaties","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"international-law_foreign-policy","label":"Foreign Policy","count":0,"topics":[{"keywords":[],"description":"Indicates the government official or body authorized to speak for the state abroad. This function could be fulfilled by the head of state, or by another government official such as the foreign minister.","key":"headforn","label":"Foreign affairs representative","count":0,"topics":[]},{"keywords":[],"description":"The process that the government must follow in order to establish a declaration of war. For example, this could be a power of the head of state, of the cabinet as a whole, or it could require consent from the legislative branch.","key":"war","label":"Power to declare/approve war","count":0,"topics":[]},{"keywords":[],"description":"","key":"neutral","label":"Neutrality in matters of war","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"international-law_treaties","label":"Treaties","count":0,"topics":[{"keywords":[],"description":"Reference to one or more specific international treaties or instruments concerning human rights.","key":"intrght","label":"International human rights treaties","count":0,"topics":[]},{"keywords":[],"description":"The steps that the government must follow to gain approval for accession to a treaty. Commonly this involves gaining the consent of part or all of the legislature.","key":"treat","label":"Treaty ratification","count":0,"topics":[]},{"keywords":[],"description":"This especially concerns the status of treaties with regard to the constitution or ordinary law, and determines whether treaties are superior or inferior to the constitution or ordinary law.","key":"treatcon","label":"Legal status of treaties","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"judiciary","label":"Judiciary","count":0,"topics":[{"keywords":[],"description":"","key":"judiciary_administrative-courts","label":"Administrative Courts","count":0,"topics":[{"keywords":[],"description":"Conditions that an individual must fulfil in order to serve as a judge in an administrative court. These often concern educational and professional credentials.","key":"adres","label":"Eligibility for administrative court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for an administrative judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"adsel","label":"Administrative court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that an administrative judge serves before either reappointment or dismissal is required.","key":"adterm","label":"Administrative court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in an administrative court.","key":"adtermn","label":"Administrative court term limits","count":0,"topics":[]},{"keywords":["appeal"],"description":"Protects individuals from the use of excess power by administrative agencies of the government. Commonly also establishes procedures for review of such actions and provides redress for those harmed.","key":"illadmin","label":"Ultra-vires administrative actions","count":0,"topics":[]},{"keywords":[],"description":"Courts that adjudicate disputes about the government's exercise of power in ordinary administrative functions.","key":"judcrts1","label":"Establishment of administrative courts","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_constitutional-court","label":"Constitutional Court","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in a constitutional court. In some cases may also provide a maximum age.","key":"conage","label":"Age restrictions on constitutional court judges","count":0,"topics":[]},{"keywords":[],"description":"Determines procedures for, or treatment of, judicial opinions handed down by the constitutional court.","key":"concop","label":"Constitutional court opinions","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in a constitutional court.","key":"conlim","label":"Constitutional court term limits","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the constitutional court, other than adjudication and review of legislation. Such powers may include supervision of elections, impeachment of the executive, review of treaties, or other specified functions.","key":"conpow","label":"Constiutional court powers","count":0,"topics":[]},{"keywords":["dismissal"],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"conrem","label":"Constitutional court removal","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge in a constitutional court. These often concern educational and professional credentials.","key":"conres","label":"Eligibility for const court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for a constitutional court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"consel","label":"Constitutional court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that a constitutional court judge serves before either reappointment or dismissal is required.","key":"conterm","label":"Constitutional court term length","count":0,"topics":[]},{"keywords":[],"description":"A court that is especially empowered to interpret the constitution, and usually to rule on whether legislation is in accord with the principles of the constitution.","key":"judcrts2","label":"Establishment of constitutional court","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_electoral-courts","label":"Electoral Courts","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in an electoral court. In some cases may also provide a maximum age.","key":"ecage","label":"Age restrictions on electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the electoral court. In addition to hearing challenges of election results, the court may be responsible for certifying various aspects of elections, including voter rolls and final vote tallies.","key":"ecpow","label":"Electoral court powers","count":0,"topics":[]},{"keywords":[],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"ecrdet","label":"Electoral court removal","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge in an electoral court. These often concern educational and professional credentials.","key":"ecres","label":"Eligibility for electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for an electoral court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"ecsel","label":"Electoral court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that an electoral judge serves before either reappointment or dismissal is required.","key":"ecterm","label":"Electoral court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in an electoral court.","key":"ecterml","label":"Electoral court term limits","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_judicial-autonomy-and-power","label":"Judicial Autonomy and Power","count":0,"topics":[{"keywords":[],"description":"Establishes the competencies of the constitutional court, other than adjudication and review of legislation. Such powers may include supervision of elections, impeachment of the executive, review of treaties, or other specified functions.","key":"conpow","label":"Constiutional court powers","count":0,"topics":[]},{"keywords":["dismissal"],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"conrem","label":"Constitutional court removal","count":0,"topics":[]},{"keywords":["dismissal"],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"jrem","label":"Supreme/ordinary court judge removal","count":0,"topics":[]},{"keywords":[],"description":"An explicit declaration that judges are autonomous or the judiciary as a whole is independent. This may include protection from outside influence on their decision making, particularly from other branches of the government.","key":"judind","label":"Judicial independence","count":0,"topics":[]},{"keywords":[],"description":"A requirement that judges must at least take into account, and potentially follow, precedents set by rulings in higher courts.","key":"judprec","label":"Judicial precedence","count":0,"topics":[]},{"keywords":[],"description":"Specifies the age at which judges must step down. A common alternative to term limits.","key":"judretir","label":"Mandatory retirement age for judges","count":0,"topics":[]},{"keywords":["remuneration","compensation"],"description":"Prevents tampering with the salaries of judges for political ends. Can bolster judicial independence. Provisions about protection of the overall judicial budget are included here.","key":"judsal","label":"Protection of judges' salaries","count":0,"topics":[]},{"keywords":[],"description":"Describes which bodies of government are empowered to interpret the constitution. This is commonly the role of a constitutional court or supreme court, but in some cases is a responsibility of all or a part of the legislature.","key":"interp","label":"Constitutional interpretation","count":0,"topics":[]},{"keywords":[],"description":"Procedures for examining whether the content of a piece of legislation is in accord with the constitution. This may or may not be permissible prior to the promulgation of the legislation.","key":"uncon","label":"Constitutionality of legislation","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the supreme court, other than adjudication and review of legislation. Such powers may include supervision of elections, impeachment of the executive, review of treaties, or other specified functions.","key":"suppow","label":"Supreme court powers","count":0,"topics":[]},{"keywords":[],"description":"","key":"crtjuris","label":"Jurisdcition of courts","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_judicial-review","label":"Judicial Review","count":0,"topics":[{"keywords":["appeal"],"description":"Protects individuals from the use of excess power by administrative agencies of the government. Commonly also establishes procedures for review of such actions and provides redress for those harmed.","key":"illadmin","label":"Ultra-vires administrative actions","count":0,"topics":[]},{"keywords":[],"description":"Gives citizens the right to request judicial review of government actions or judgments that they believe have violated their rights.","key":"amparo","label":"Right to amparo","count":0,"topics":[]},{"keywords":[],"description":"Describes which bodies of government are empowered to interpret the constitution. This is commonly the role of a constitutional court or supreme court, but in some cases is a responsibility of all or a part of the legislature.","key":"interp","label":"Constitutional interpretation","count":0,"topics":[]},{"keywords":[],"description":"Procedures for examining whether the content of a piece of legislation is in accord with the constitution. This may or may not be permissible prior to the promulgation of the legislation.","key":"uncon","label":"Constitutionality of legislation","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_ordinary-courts","label":"Ordinary Courts","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in an ordinary court. In some cases may also provide a maximum age.","key":"ordage","label":"Age restrictions on ordinary court judges","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge in an ordinary court. These often concern educational and professional credentials.","key":"ordres","label":"Eligibility for ordinary court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for an ordinary court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"ordsel","label":"Ordinary court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that an ordinary court judge serves before either reappointment or dismissal is required.","key":"ordterm","label":"Ordinary court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in an ordinary court.","key":"ordterml","label":"Ordinary court term limits","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_structure-of-the-judiciary","label":"Structure of the Judiciary","count":0,"topics":[{"keywords":[],"description":"Courts that adjudicate disputes about the government's exercise of power in ordinary administrative functions.","key":"judcrts1","label":"Establishment of administrative courts","count":0,"topics":[]},{"keywords":[],"description":"A court that is especially empowered to interpret the constitution, and usually to rule on whether legislation is in accord with the principles of the constitution.","key":"judcrts2","label":"Establishment of constitutional court","count":0,"topics":[]},{"keywords":["appeal"],"description":"Courts that review government actions to determine whether an individual's rights were infringed or violated.","key":"judcrts3","label":"Establishment of courts of amparo","count":0,"topics":[]},{"keywords":[],"description":"Courts with jurisdiction limited to charges against members of the military, and tasked with enforcing military law.","key":"judcrts4","label":"Establishment of military courts","count":0,"topics":[]},{"keywords":[],"description":"Special courts that are empowered to review the actions of public servants acting in their official capacity.","key":"judcrts5","label":"Courts for judging public officials","count":0,"topics":[]},{"keywords":[],"description":"Courts with limited jurisdiction to adjudicate disputes between individuals or businesses and the state with regard to taxation.","key":"judcrts6","label":"Establishment of tax courts","count":0,"topics":[]},{"keywords":[],"description":"Courts with limited jurisdiction to adjudicate disputes between individuals or trade unions and businesses.","key":"judcrts7","label":"Establishment of labor courts","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Courts with limited jurisdiction to adjudicate matters arising in religious law. Jurisdiction may be limited on a confessional basis.","key":"judcrts8","label":"Establishment of religious courts","count":0,"topics":[]},{"keywords":[],"description":"Establishes the basic organization of the judicial branch. In some cases only the highest court is established, leaving further organization to be determined by ordinary legislation.","key":"levjud","label":"Structure of the courts","count":0,"topics":[]},{"keywords":[],"description":"Establishes a special body to monitor judges. Judicial councils are commonly tasked with reviewing complaints about judges, and are sometimes involved in selecting, promoting, and removing judges.","key":"jc","label":"Establishment of judicial council","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"judiciary_supreme-court","label":"Supreme Court","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge on the supreme court. In some cases may also provide a maximum age.","key":"hocage","label":"Age restrictions on supreme court judges","count":0,"topics":[]},{"keywords":[],"description":"Determines procedures for, or treatment of, judicial opinions handed down by the supreme court.","key":"hocop","label":"Supreme court opinions","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge on the supreme court. These often concern educational and professional credentials.","key":"hocres","label":"Eligibility for supreme court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for a supreme court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"hocsel","label":"Supreme court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that a supreme court justice serves before either reappointment or dismissal is required.","key":"hocterm","label":"Supreme court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge on the supreme court.","key":"hocterml","label":"Supreme court term limits","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the supreme court, other than adjudication and review of legislation. Such powers may include supervision of elections, impeachment of the executive, review of treaties, or other specified functions.","key":"suppow","label":"Supreme court powers","count":0,"topics":[]},{"keywords":[],"description":"Establishes the number of seats on the supreme court.","key":"hocsize","label":"Number of supreme court judges","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"legislature","label":"Legislature","count":0,"topics":[{"keywords":[],"description":"","key":"legislature_first-chamber","label":"First Chamber","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained to be eligible to serve as a representative in the first chamber of the legislature. In some cases may also provide a maximum age.","key":"lhage","label":"Age restrictions on first chamber","count":0,"topics":[]},{"keywords":[],"description":"Names the office that presides over the first chamber of the legislature. This function might be fulfilled by the head of government, a member of the chamber, the deputy executive, or another official.","key":"lhlead","label":"Leader of first chamber","count":0,"topics":[]},{"keywords":["gender","minority","women's rights"],"description":"Specifies the proportion of the seats in the first chamber that must be assigned to representatives of a particular group, such as women, ethnic groups, political parties, religious groups, or social classes.","key":"lhquota","label":"First chamber representation quotas","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a representative in the first chamber of the legislature. These often concern residency, proficiency in the official language, or prior occupation.","key":"lhrest","label":"Eligibility for first chamber","count":0,"topics":[]},{"keywords":[],"description":"The total number of seats in the first chamber of the legislature.","key":"lhseats","label":"Size of first chamber","count":0,"topics":[]},{"keywords":[],"description":"Describes the procedure through which members of the first chamber of the legislature are elected or appointed.","key":"lhselect","label":"First chamber selection","count":0,"topics":[]},{"keywords":[],"description":"Names specific areas of legislation that are a special concern for the first chamber. This may include sole authority to legislate in these areas.","key":"lhspleg","label":"First chamber reserved policy areas","count":0,"topics":[]},{"keywords":[],"description":"The number of years that a representative in the first chamber of the legislature serves before reelection, reappointment, or dismissal is required.","key":"lhterm","label":"Term length for first chamber","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a representative in the first chamber of the legislature.","key":"lhtrmlim","label":"Term limits for first chamber","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_legislation","label":"Legislation","count":0,"topics":[{"keywords":[],"description":"Specifies the manner in which the work of the legislative process is divided between the two chambers of the legislature. For example, legislation could be considered concurrently or sequentially, or could be divided on the basis of policy areas.","key":"divhouse","label":"Division of labor between chambers","count":0,"topics":[]},{"keywords":["veto"],"description":"The power to approve or reject legislation, in whole or in part, after it has been passed by the legislature. Some systems do not require this final step.","key":"legapp","label":"Approval or veto of general legislation","count":0,"topics":[]},{"keywords":[],"description":"Specifies who has the power to propose new legislation. Beyond members of the legislature, this may or may not be extended to political parties, the general public, the head of government, or the head of state.","key":"legini","label":"Initiation of general legislation","count":0,"topics":[]},{"keywords":[],"description":"Particularly vital or contentious policy areas may require a supermajority of a specified size in order to pass legislation. Although constitutional amendments often require a supermajority, this topic addresses ordinary legislation only.","key":"legsupr","label":"Supermajority required for legislation","count":0,"topics":[]},{"keywords":[],"description":"Allows the legislature to take additional steps to pass legislation that has been vetoed by the actor responsible for approving or rejecting legislation. This typically requires a supermajority, but there is some variation.","key":"override","label":"Veto override procedure","count":0,"topics":[]},{"keywords":["lobbying","interest groups","private bills"],"description":"Provisions about legislation introduced by private parties or other non-legislators. May address regulation of interest groups and/or lobbying activities.","key":"leginfl","label":"Outside participation in legislation","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_legislative-independence-and-power","label":"Legislative Independence and Power","count":0,"topics":[{"keywords":["veto"],"description":"The power to approve or reject legislation, in whole or in part, after it has been passed by the legislature. Some systems do not require this final step.","key":"legapp","label":"Approval or veto of general legislation","count":0,"topics":[]},{"keywords":[],"description":"Allows the legislature to take additional steps to pass legislation that has been vetoed by the actor responsible for approving or rejecting legislation. This typically requires a supermajority, but there is some variation.","key":"override","label":"Veto override procedure","count":0,"topics":[]},{"keywords":[],"description":"Protection, whether absolute or limited, against prosecution for members of the legislature. This may involve protection against prosecution for certain kinds of crimes, or for a specified period of time.","key":"immunity","label":"Immunity of legislators","count":0,"topics":[]},{"keywords":["removal"],"description":"Specifies who has the authority to dismiss the legislature. May also specify the conditions under which this may take place.","key":"legdiss","label":"Dismissal of the legislature","count":0,"topics":[]},{"keywords":[],"description":"Establishes the procedure through which a seat in the legislature may be filled in the event that a legislator has been removed from office, resigns, or dies. ","key":"legrep","label":"Replacement of legislators","count":0,"topics":[]},{"keywords":["dismissal"],"description":"Procedures for removing individual members of the legislature for crimes or malfeasance. In some cases this action is taken by the legislator's chamber.","key":"remleg","label":"Removal of individual legislators","count":0,"topics":[]},{"keywords":[],"description":"Details the specific powers, or limits on the powers, of the national legislature. May refer to areas of legislative authority, procedural powers, or other matters of legislative competence.","key":"legpow","label":"Powers of the national legislature","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_legislative-rules-and-restrictions","label":"Legislative Rules and Restrictions","count":0,"topics":[{"keywords":["remuneration","compensation"],"description":"Requires legislators to disclose their income, or the value of their assets. This disclosure is typically made to a specified official or commission, and is not necessarily made public.","key":"assets","label":"Earnings disclosure requirement","count":0,"topics":[]},{"keywords":["sessions"],"description":"Requires legislators to attend sessions or votes. Examples include mandatory attendance, punishment after a specified number of absences, or delegating the matter to ordinary law.","key":"attend","label":"Attendance by legislators","count":0,"topics":[]},{"keywords":[],"description":"Establishes who has the authority to call an extraordinary session of the legislature, and in some cases what circumstances would allow them to take such action.","key":"exsess","label":"Extraordinary legislative sessions","count":0,"topics":[]},{"keywords":["remuneration","compensation"],"description":"Specifies the actors involved in establishing the compensation of legislators. In addition to the legislature, this might involve the head of state, head of government, an independent commission, or other actors.","key":"income","label":"Compensation of legislators","count":0,"topics":[]},{"keywords":[],"description":"Mechanisms that allow the legislative branch to ensure that executive agencies are enforcing the laws according to the intent of the legislature. Also provides a check on the misuse or abuse of executive power.","key":"invexe","label":"Legislative oversight of the executive","count":0,"topics":[]},{"keywords":[],"description":"Provides for the two chambers of a bicameral legislature to meet jointly. This may involve a body made up of both chambers, or a special joint session for specific purposes.","key":"legjoint","label":"Joint meetings of legislative chambers","count":0,"topics":[]},{"keywords":[],"description":"May bar legislators from engaging in other occupations during their term in office. Limitations might include prohibitions on holding some or all other public offices, or engaging in private business.","key":"profleg","label":"Outside professions of legislators","count":0,"topics":[]},{"keywords":["information"],"description":"Specifies whether the legislature is to conduct its business in public or in private. When legislative sessions are generally public, some constitutions may also specify the conditions (if any) under which the legislature may hold private sessions.","key":"pubmeet","label":"Public or private sessions","count":0,"topics":[]},{"keywords":["information","debate"],"description":"Requires that a written record of the deliberations of the legislature be published.","key":"pubmin","label":"Publication of deliberations","count":0,"topics":[]},{"keywords":[],"description":"The legislature is only permitted to conduct its business, especially to vote on legislation, when a certain percentage of its members are present.","key":"quorum","label":"Quorum for legislative sessions","count":0,"topics":[]},{"keywords":["information"],"description":"Establishes the level of transparency in legislative voting. This could be a matter of public record, always kept secret, or varied depending on the topic of the vote.","key":"recvote","label":"Secrecy of legislative votes","count":0,"topics":[]},{"keywords":[],"description":"The number of days or months that the legislature meets within a year.","key":"session","label":"Length of legislative sessions","count":0,"topics":[]},{"keywords":["lobbying","interest groups","private bills"],"description":"Provisions about legislation introduced by private parties or other non-legislators. May address regulation of interest groups and/or lobbying activities.","key":"leginfl","label":"Outside participation in legislation","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_removal-and-replacement","label":"Removal and Replacement","count":0,"topics":[{"keywords":[],"description":"Protection, whether absolute or limited, against prosecution for members of the legislature. This may involve protection against prosecution for certain kinds of crimes, or for a specified period of time.","key":"immunity","label":"Immunity of legislators","count":0,"topics":[]},{"keywords":["removal"],"description":"Specifies who has the authority to dismiss the legislature. May also specify the conditions under which this may take place.","key":"legdiss","label":"Dismissal of the legislature","count":0,"topics":[]},{"keywords":[],"description":"Establishes the procedure through which a seat in the legislature may be filled in the event that a legislator has been removed from office, resigns, or dies. ","key":"legrep","label":"Replacement of legislators","count":0,"topics":[]},{"keywords":["dismissal"],"description":"Procedures for removing individual members of the legislature for crimes or malfeasance. In some cases this action is taken by the legislator's chamber.","key":"remleg","label":"Removal of individual legislators","count":0,"topics":[]},{"keywords":["at large"],"description":"Establishes honorary positions for retired public officials, such as positions in the legislature for former presidents.","key":"honorary","label":"Honorary positions for retired office holders","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_second-chamber","label":"Second Chamber","count":0,"topics":[{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained to be eligible to serve as a representative in the second chamber of the legislature. In some cases may also provide a maximum age.","key":"uhage","label":"Age restrictions on second chamber","count":0,"topics":[]},{"keywords":[],"description":"Names the office that presides over the second chamber of the legislature. This function might be fulfilled by a member of the chamber, the deputy executive, or another official.","key":"uhlead","label":"Leader of second chamber","count":0,"topics":[]},{"keywords":["gender","minority","women's rights"],"description":"Specifies the proportion of the seats in the second chamber that must be assigned to representatives of a particular group, such as women, ethnic groups, political parties, religious groups, or social classes.","key":"uhquota","label":"Second chamber representation quotas","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a representative in the second chamber of the legislature. These often concern residency, proficiency in the official language, or prior occupation.","key":"uhrest","label":"Eligibility for second chamber","count":0,"topics":[]},{"keywords":[],"description":"The total number of seats in the second chamber of the legislature.","key":"uhseats","label":"Size of second chamber","count":0,"topics":[]},{"keywords":[],"description":"Describes the procedure through which members of the second chamber of the legislature are elected or appointed. This is often different from the selection procedure used for the first chamber.","key":"uhselect","label":"Second chamber selection","count":0,"topics":[]},{"keywords":[],"description":"Names specific areas of legislation that are a special concern for the second chamber. This may include sole authority to legislate in these areas.","key":"uhspleg","label":"Second chamber reserved policy areas","count":0,"topics":[]},{"keywords":[],"description":"The number of years that a representative in the second chamber of the legislature serves before reelection, reappointment, or dismissal is required.","key":"uhterm","label":"Term length of second chamber","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a representative in the second chamber of the legislature.","key":"uhtrmlim","label":"Term limits of second chamber","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_special-legislation","label":"Special Legislation","count":0,"topics":[{"keywords":[],"description":"A requirement that the government pass a budget in which incoming revenue meets or exceeds the value of the government's expenditures in a fiscal year.","key":"balbudgt","label":"Balanced budget","count":0,"topics":[]},{"keywords":[],"description":"Special legislative processes for budget bills, which may include restrictions on proposal, approval, or amendment. Budget bills refer to legislation that lays out the revenues and expenditures for some period of time, usually in years.","key":"budget","label":"Budget bills","count":0,"topics":[]},{"keywords":["communism"],"description":"Mention of national economic plans, possibly with the procedure for establishing them. Such procedures may include special rules for proposal, approval, or amendment.","key":"econplan","label":"Economic plans","count":0,"topics":[]},{"keywords":["budget"],"description":"Special legislative processes for finance bills, which may include restrictions on proposal, approval, or amendment. Finance bills refer to legislation specifically for the borrowing of money for governmental use, like loans from NGOs, other countries, or even private individuals.","key":"finance","label":"Finance bills","count":0,"topics":[]},{"keywords":[],"description":"Special legislative processes for organic laws, which may include restrictions on proposal, approval, or amendment. Organic laws establish fundamental aspects of the constitutional order, including establishing institutions like the courts or legislature, and in some jurisdictions are accorded similar status to the constitution itself. They sometimes require a higher standard for approval than ordinary law.","key":"orglaw","label":"Organic laws","count":0,"topics":[]},{"keywords":["budget"],"description":"Special legislative processes for spending bills, which may include restrictions on proposal, approval, or amendment. Spending bills refer to legislation specifically for the expenditure of government money.","key":"spend","label":"Spending bills","count":0,"topics":[]},{"keywords":["budget"],"description":"Special legislative processes for tax bills, which may include restrictions on proposal, approval, or amendment. Tax bills refer to legislation specifically for collecting revenue for public use, usually in the form of taxes or tariffs.","key":"tax","label":"Tax bills","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"legislature_structure-of-the-legislature","label":"Structure of the Legislature","count":0,"topics":[{"keywords":[],"description":"The constitution establishes the existence of legislative committees. Sometimes details on formation and procedure are provided.","key":"commit","label":"Legislative committees","count":0,"topics":[]},{"keywords":[],"description":"Establishes the number of chambers in the legislature.","key":"housenum","label":"Structure of legislative chamber(s)","count":0,"topics":[]},{"keywords":["communism"],"description":"Establishes permanent committees with oversight in given policy areas, which often exercise legislative authority when the legislature is not in session. May also specify how members of these committees are selected, and how long they serve.","key":"stdcom","label":"Standing committees","count":0,"topics":[]},{"keywords":["at large"],"description":"Establishes honorary positions for retired public officials, such as positions in the legislature for former presidents.","key":"honorary","label":"Honorary positions for retired office holders","count":0,"topics":[]},{"keywords":["district"],"description":"Establishes the process by which seats in the legislature are distributed among districts or subnational units.","key":"apportn","label":"Apportionment of seats in legislature","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"principles-and-symbols","label":"Principles and Symbols","count":0,"topics":[{"keywords":[],"description":"","key":"principles-and-symbols_basic-principles","label":"Basic Principles","count":0,"topics":[{"keywords":["culture"],"description":"References to art or artists indicate the importance of art to the national identity, and are often made in the context of mandating state support for the arts.","key":"artists","label":"References to art","count":0,"topics":[]},{"keywords":[],"description":"Establishes the agent with the authority to install the constitution or from which the state derives its ultimate authority. Many constitutions invoke the people, an assembly, a group of subnational units, a monarch, or a deity.","key":"auth","label":"Source of constitutional authority","count":0,"topics":[]},{"keywords":["corruption"],"description":"Requires that officials in the public service are recruited and promoted on the basis of merit. This is intended to be a hedge against patronage and nepotism, and may require standardized exams or a specified kind of credential.\n","key":"civil","label":"Civil service recruitment","count":0,"topics":[]},{"keywords":["protectorates","territories","decolonization","independence"],"description":"Mention of territory beyond the national borders that is under the government's control. This may include colonies, protectorates, or territories.","key":"colony","label":"Colonies","count":0,"topics":[]},{"keywords":[],"description":"Reference to historical figures or political theorists. Usually mentioned in the preamble in the context of a particular political tradition.","key":"figures","label":"Political theorists/figures","count":0,"topics":[]},{"keywords":[],"description":"Frames the constitution in a particular context. Often a response to the country's recent history.","key":"motive","label":"Motives for writing constitution","count":0,"topics":[]},{"keywords":[],"description":"Requires certain public office holders to take an oath to support or abide by the constitution.","key":"oath","label":"Oaths to abide by constitution","count":0,"topics":[]},{"keywords":[],"description":"May invoke particular triumphs or tragedies in the country's past. Situates the constitution in the country's larger legal and political identity.","key":"prevcond","label":"Reference to country's history","count":0,"topics":[]},{"keywords":["transitional justice"],"description":"Usually in the context of specifying the new regime's treatment of these crimes. May grant amnesty or require punishment.","key":"prevlead","label":"Crimes of the previous regime","count":0,"topics":[]},{"keywords":["international organizations"],"description":"Reference to a group of states, a geographical region, or an intergovernmental organization, such as the European Union.","key":"region","label":"Regional group(s)","count":0,"topics":[]},{"keywords":["environment"],"description":"Describes ownership of natural resources in general, or makes specific references to ownership or use of energy, mineral, water, flora, fauna, or other natural resources.","key":"resrce","label":"Ownership of natural resources","count":0,"topics":[]},{"keywords":[],"description":"Reference to science, which may include prioritization of investment in scientific research, or mandate state support for science and innovation.","key":"science","label":"References to science","count":0,"topics":[]},{"keywords":["communism"],"description":"Considered one of the fundamental values of many states. Often mentioned in the preamble as a motivation for the constitution.","key":"solid","label":"Reference to fraternity/solidarity","count":0,"topics":[]},{"keywords":["structure"],"description":"A description of the system of government that the constitution is intended to create. Could be a description of the structure of the state, or of the political system.","key":"system","label":"Type of government envisioned","count":0,"topics":[]},{"keywords":["personhood"],"description":"Establishes the definition and scope of personhood for legal and constitutional purposes.","key":"person","label":"Legal definition of a person","count":0,"topics":[]},{"keywords":["subversives","extremists"],"description":"Establishes restrictions on categories of people who can hold public service positions. May prevent members of particilar religions, parties, or previous regimes from holding such positions.","key":"pubrest","label":"Restrictions on public service","count":0,"topics":[]},{"keywords":["subversion"],"description":"Establishes the definition or treatment of treason. May include the penalties therefor.","key":"treason","label":"Definition of treason","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"principles-and-symbols_state-definition-and-symbols","label":"State Definition and Symbols","count":0,"topics":[{"keywords":[],"description":"Names the official anthem of the state.","key":"anthem","label":"National anthem","count":0,"topics":[]},{"keywords":[],"description":"Names the capital city of the state.","key":"capital","label":"National capital","count":0,"topics":[]},{"keywords":[],"description":"Describes the principal features of the national flag.","key":"flag","label":"National flag","count":0,"topics":[]},{"keywords":[],"description":"Affirms the national motto, sometimes in more than one language.","key":"motto","label":"National motto","count":0,"topics":[]},{"keywords":[],"description":"Establishes the official name of the country. May include provisions about changing the name of the country.","key":"country","label":"Name of country","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"regulation-and-oversight","label":"Regulation and Oversight","count":0,"topics":[{"keywords":[],"description":"","key":"regulation-and-oversight_economy","label":"Economy","count":0,"topics":[{"keywords":["industry","banking","interstate commerce","trade","labor","finance"],"description":"","key":"econreg","label":"Regulation of economic activity","count":0,"topics":[]},{"keywords":["business","enterprise","corporation"],"description":"Establishes regulations on the use of government funds to support private organizations, businesses, or other entities.","key":"privsupp","label":"Government support for private parties","count":0,"topics":[]},{"keywords":["competition","business"],"description":"Regulation or restriction of state-owned businesses and enterprises.","key":"stateown","label":"State-owned enterprises","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"regulation-and-oversight_elections","label":"Elections","count":0,"topics":[{"keywords":[],"description":"Describes which branch or body of the government has the power to regulate political parties, particularly those tasked with determining the unconstitutionality of certain parties.","key":"partunco","label":"Regulation of political parties","count":0,"topics":[]},{"keywords":[],"description":"Most commonly establishes the minimum age that an individual must have attained before assuming the office of judge in an electoral court. In some cases may also provide a maximum age.","key":"ecage","label":"Age restrictions on electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"Establishes the competencies of the electoral court. In addition to hearing challenges of election results, the court may be responsible for certifying various aspects of elections, including voter rolls and final vote tallies.","key":"ecpow","label":"Electoral court powers","count":0,"topics":[]},{"keywords":[],"description":"In cases where a judge has committed a crime, or otherwise compromised the integrity of their office, he or she may be removed from office. This may be carried out by the legislature, the executive, or another competent body.","key":"ecrdet","label":"Electoral court removal","count":0,"topics":[]},{"keywords":[],"description":"Qualifications that an individual must meet in order to serve as a judge in an electoral court. These often concern educational and professional credentials.","key":"ecres","label":"Eligibility for electoral court judges","count":0,"topics":[]},{"keywords":[],"description":"The procedure through which a candidate for an electoral court judgeship is nominated and approved. This might involve approval from the executive, and all or part of the legislature.","key":"ecsel","label":"Electoral court selection","count":0,"topics":[]},{"keywords":[],"description":"The number of years that an electoral judge serves before either reappointment or dismissal is required.","key":"ecterm","label":"Electoral court term length","count":0,"topics":[]},{"keywords":[],"description":"The number of terms, either consecutive or in total, that an individual may serve as a judge in an electoral court.","key":"ecterml","label":"Electoral court term limits","count":0,"topics":[]},{"keywords":[],"description":"An independent commission responsible for facilitating and regulating elections. May be responsible for monitoring political parties and the financing of elections.","key":"ecom","label":"Electoral commission","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"regulation-and-oversight_independent-agencies-and-commissions","label":"Independent Agencies and Commissions","count":0,"topics":[{"keywords":["economy"],"description":"Establishes or affirms a central bank. May also include requirements for its governance and operations.","key":"bank","label":"Central bank","count":0,"topics":[]},{"keywords":[],"description":"An independent commission specifically empowered to investigate corruption within the government.","key":"cc","label":"Counter corruption commission","count":0,"topics":[]},{"keywords":[],"description":"An independent commission responsible for facilitating and regulating elections. May be responsible for monitoring political parties and the financing of elections.","key":"ecom","label":"Electoral commission","count":0,"topics":[]},{"keywords":[],"description":"An independent commission tasked with investigating potential violations of human rights. The commission may be empowered to take action, or may be required to forward its findings to the regular courts.","key":"hr","label":"Human rights commission","count":0,"topics":[]},{"keywords":[],"description":"Establishes a special body to monitor judges. Judicial councils are commonly tasked with reviewing complaints about judges, and are sometimes involved in selecting, promoting, and removing judges.","key":"jc","label":"Establishment of judicial council","count":0,"topics":[]},{"keywords":[],"description":"Establishes a commission to regulate mass media. This may include ensuring free expression, and in some cases enforcing some form of censorship.","key":"medcom","label":"Media commission","count":0,"topics":[]},{"keywords":[],"description":"A public official tasked with investigating improper or illegal actions on the part of government agencies which may infringe on the rights of individuals. Enables individuals to bring complaints about the actions of the government.","key":"ombuds","label":"Ombudsman","count":0,"topics":[]},{"keywords":["transitional justice"],"description":"A special commission tasked with hearing testimony and gathering evidence about human rights violations and other crimes, usually committed by a previous regime. Testimony given in such a commission may or may not be protected from use in future prosecutions.","key":"truthcom","label":"Truth and reconciliation commission","count":0,"topics":[]},{"keywords":["mail","correspondence","postmaster","post","communications"],"description":"Provisions establishing or regulating a national postal service. May provide for the appointment or replacement of postmasters.","key":"postserv","label":"Postal service","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"regulation-and-oversight_media-and-communications","label":"Media and Communications","count":0,"topics":[{"keywords":["communications","telecommunications","press","information"],"description":"Describes the relationship between the state and the media. This may give the state control over all media, allow the state to operate some media, or prohibit the state from such activities.","key":"govmed","label":"State operation of the media","count":0,"topics":[]},{"keywords":["communications","telecommunications","information"],"description":"Reference to the wireless transmission of audio programs, usually in the context of regulation.","key":"radio","label":"Radio","count":0,"topics":[]},{"keywords":["communications","information"],"description":"Reference to wired or wireless communication, and the industries that support it, usually in the context of regulation. Includes telephones, satellites, the internet, and other communication technologies.","key":"telecom","label":"Telecommunications","count":0,"topics":[]},{"keywords":["communications","telecommunications","information"],"description":"Reference to the wireless transmission of audio-visual programs, usually in the context of regulation.","key":"tv","label":"Television","count":0,"topics":[]},{"keywords":[],"description":"Establishes a commission to regulate mass media. This may include ensuring free expression, and in some cases enforcing some form of censorship.","key":"medcom","label":"Media commission","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"regulation-and-oversight_social-issues","label":"Social Issues","count":0,"topics":[{"keywords":["alcohol","prohibition","marijuana","cannabis","trafficking","intoxicate","narcotics"],"description":"Provisions about the regulation or criminalization of the trafficking, sale, or consumption of alcohol, drugs, or other controlled or illegal substances.","key":"illsub","label":"Drugs, alcohol, and illegal substances","count":0,"topics":[]},{"keywords":["roads","highways","railways","bridges","ports","public works","airports"],"description":"","key":"transprt","label":"Transportation and infrastructure","count":0,"topics":[]},{"keywords":["national security","law enforcement"],"description":"Establishes or regulates national police or public security forces. May also include provisions about regulatory bodies, such as Police Service Commissions.","key":"police","label":"Police or public security","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"rights-and-duties","label":"Rights and Duties","count":0,"topics":[{"keywords":[],"description":"","key":"rights-and-duties_citizen-duties","label":"Citizen Duties","count":0,"topics":[{"keywords":[],"description":"A duty to serve a specified period of time in the country's military. Often also includes protections for conscientious objectors.","key":"milserv","label":"Duty to serve in the military","count":0,"topics":[]},{"keywords":[],"description":"Requires all citizens to be a member of a political party, or of the sole political party of the state.","key":"prtyduty","label":"Duty to join a political party","count":0,"topics":[]},{"keywords":[],"description":"Requires all citizens to contribute to the expenses of the state through taxes. This is usually a general statement and may still allow for variation on the basis of income.","key":"taxes","label":"Duty to pay taxes","count":0,"topics":[]},{"keywords":[],"description":"Requires individuals to contribute to the betterment of their society through work. This is usually a general statement and may still allow for variation on the basis of disability, age or other factors.","key":"work","label":"Duty to work","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_civil-and-political-rights","label":"Civil and Political Rights","count":0,"topics":[{"keywords":["nationals","subjects"],"description":"Grants individuals the right to renounce their citizenship. This right is sometimes subject to qualifications relating to dual-citizenship, or the existence of a state of war.","key":"citren","label":"Right to renounce citizenship","count":0,"topics":[]},{"keywords":["voting"],"description":"The right to vote is held by all citizens. There may nevertheless be some restrictions on voting by residency, age, residency or criminal conviction.","key":"voteun","label":"Claim of universal suffrage","count":0,"topics":[]},{"keywords":[],"description":"Allows scholars to pursue their research agenda without undue interference from the state. This is usually understood to also include freedom to teach and publish.","key":"acfree","label":"Right to academic freedom","count":0,"topics":[]},{"keywords":[],"description":"Grants individuals the right to possess firearms and other weapons. This right may in some jurisdictions still be subject to regulation of the kinds of weapons that can be possessed, and the places and manners in which they may be transported.","key":"arms","label":"Right to bear arms","count":0,"topics":[]},{"keywords":[],"description":"Grants individuals the right to gather in groups, in public spaces, for any otherwise legal purpose. This is right is closely associated with the idea of protest.","key":"assem","label":"Freedom of assembly","count":0,"topics":[]},{"keywords":[],"description":"Grants individuals the right to form groups or associations for any otherwise legal purpose. This also sometimes includes the right not to join or associate with a group.","key":"assoc","label":"Freedom of association","count":0,"topics":[]},{"keywords":["family","minors","juveniles"],"description":"Children are guaranteed certain rights or afforded special protections, which may include state-provided education and healthcare, and/or the right to be free from any kind of abuse.","key":"childpro","label":"Rights of children","count":0,"topics":[]},{"keywords":["family"],"description":"Recognizes secular marriages performed by a government official or other so empowered individuals, or religious marriages that also involve a license from the state.","key":"civmar","label":"Provision for civil marriage","count":0,"topics":[]},{"keywords":["bankruptcy"],"description":"Protection for individuals who are unable to repay loans or other financial obligations. The contractual rights of the lender are qualified by the right of the debtor to their freedom or dignity.","key":"debtors","label":"Rights of debtors","count":0,"topics":[]},{"keywords":[],"description":"Grants individuals the right to both develop and express their own unique personality.","key":"devlpers","label":"Right to development of personality","count":0,"topics":[]},{"keywords":[],"description":"Considered one of the fundamental values of many states. Often mentioned in the preamble as a motivation for the constitution. Also a justification for some constitutional provisions.","key":"dignity","label":"Human dignity","count":0,"topics":[]},{"keywords":["speech"],"description":"Grants individuals the right to express their thoughts and feelings without prior censorship or other forms of governmental interference. This right is rarely absolute, and is often limited in cases of sedition, hate speech, or obscenity.","key":"express","label":"Freedom of expression","count":0,"topics":[]},{"keywords":["family"],"description":"Grants individuals the right to commit to one another and raise children together. This right is closely tied to the right to marry. Many constitutions stipulate only a general state duty to protect the family.","key":"fndfam","label":"Right to found a family","count":0,"topics":[]},{"keywords":[],"description":"Grants citizens the right to travel and reside anywhere within the state, and to travel to and from other countries. The right does not normally grant non-citizens access to the state.","key":"freemove","label":"Freedom of movement","count":0,"topics":[]},{"keywords":["church","secular"],"description":"Grants individuals the right to hold religious beliefs, and to freely practice those religious beliefs. This right is also commonly understood to include the right to change one's religion, or to have no religion at all.","key":"freerel","label":"Freedom of religion","count":0,"topics":[]},{"keywords":[],"description":"Grants individuals access to information collected or held by the government, particularly information about oneself, or information of general public interest.","key":"infoacc","label":"Right to information","count":0,"topics":[]},{"keywords":["libel"],"description":"Grants individuals the right to defend themselves against libel or slander. Understood in the context of freedom of expression, this may not include prior censorship, allowing instead for legal remedy after the fact.","key":"libel","label":"Right to protect one's reputation","count":0,"topics":[]},{"keywords":["family","divorce"],"description":"Regulates marriage, including granting the right to marry and establishing rules regarding divorce. May include a definition of marriage, and may or may not be limited to heterosexual couples.","key":"marriage","label":"Regulation of marriage","count":0,"topics":[]},{"keywords":["military"],"description":"Grants individuals whose religious or ethical beliefs prevent them from participating in war an exemption from military service.","key":"nomil","label":"Right to conscientious objection","count":0,"topics":[]},{"keywords":["religion","church","secular"],"description":"Grants individuals the right to believe or think anything they find compelling. This does not necessarily mean that they have a right to express these beliefs.","key":"opinion","label":"Freedom of opinion/thought/conscience","count":0,"topics":[]},{"keywords":["revolution","revolt"],"description":"Grants citizens the right to overthrow the government under certain circumstances. This right is usually expressed in terms of defending the constitutional order, rather than establishing a new one.","key":"overthrw","label":"Right to overthrow government","count":0,"topics":[]},{"keywords":[],"description":"Grants groups and individuals the right to bring petitions to the government. This includes the right to bring complaints about the actions of the government.","key":"petition","label":"Right of petition","count":0,"topics":[]},{"keywords":["communications","telecommunications","media"],"description":"Grants individuals, especially journalists and publishers, the right to free expression through all forms of media. In many jurisdictions this includes a protection against prior censorship.","key":"press","label":"Freedom of press","count":0,"topics":[]},{"keywords":["correspondence","secrecy","mail","postal","communications","domicile"],"description":"Grants individuals protection against government intrusion into their property, papers, person, or communications without proper authorization. Also protects against such intrusions by private individuals.","key":"privacy","label":"Right to privacy","count":0,"topics":[]},{"keywords":["guardians"],"description":"Grants parents certain rights or duties regarding their children. May include the duty to provide for one's legal children, or the right to make decisions about their education.","key":"parents","label":"Rights or duties of parents","count":0,"topics":[]},{"keywords":["abortion","contraception","birth control","maternal"],"description":"Grants individuals the right to make decisions about reproduction and family planning. May include provisions about access to contraception, abortion, or other forms of reproductive health care. ","key":"reproduc","label":"Reproductive rights","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_economic-rights","label":"Economic Rights","count":0,"topics":[{"keywords":[],"description":"Grants individuals the right to establish for-profit commercial endeavors.","key":"busines","label":"Right to establish a business","count":0,"topics":[]},{"keywords":["property"],"description":"Protects individuals and businesses from government confiscation of their property without proper compensation. The level of compensation may be variously specified as fair, full, appropriate, adequate, or otherwise.","key":"exprop","label":"Protection from expropriation","count":0,"topics":[]},{"keywords":[],"description":"Protects individuals and businesses from monopolies, price fixing, and other means of reducing competition in the marketplace.","key":"freecomp","label":"Right to competitive marketplace","count":0,"topics":[]},{"keywords":["trademarks","patents","copyright"],"description":"Gives individuals and businesses the exclusive right to protect and profit from their creative works.","key":"intprop","label":"Provisions for intellectual property","count":0,"topics":[]},{"keywords":["labor"],"description":"Grants individuals the freedom to choose their occupation and their place of employment without interference from the government.","key":"occupate","label":"Right to choose occupation","count":0,"topics":[]},{"keywords":[],"description":"Allows individuals and corporations the sole ownership of real property, effects, financial instruments, or other objects. This right is in some cases open to violation in the interests of the community.","key":"proprght","label":"Right to own property","count":0,"topics":[]},{"keywords":["inheritance","testate"],"description":"Grants the right to dispose of property through sale, gift, private wills, or other means.","key":"transfer","label":"Right to transfer property","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_enforcement","label":"Enforcement","count":0,"topics":[{"keywords":[],"description":"Gives citizens the right to request judicial review of government actions or judgments that they believe have violated their rights.","key":"amparo","label":"Right to amparo","count":0,"topics":[]},{"keywords":["appeal"],"description":"Courts that review government actions to determine whether an individual's rights were infringed or violated.","key":"judcrts3","label":"Establishment of courts of amparo","count":0,"topics":[]},{"keywords":[],"description":"An independent commission tasked with investigating potential violations of human rights. The commission may be empowered to take action, or may be required to forward its findings to the regular courts.","key":"hr","label":"Human rights commission","count":0,"topics":[]},{"keywords":[],"description":"A public official tasked with investigating improper or illegal actions on the part of government agencies which may infringe on the rights of individuals. Enables individuals to bring complaints about the actions of the government.","key":"ombuds","label":"Ombudsman","count":0,"topics":[]},{"keywords":["inalienable","inviolable","derogable"],"description":"Rights that are understood to be unassailable, either because they are fundamental or “natural.” In some countries, they may be absolute rights, not subject even to qualification.","key":"inalrght","label":"Inalienable rights","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_equality-gender-and-minority-rights","label":"Equality, Gender, and Minority Rights","count":0,"topics":[{"keywords":["refugees","asylum"],"description":"Requires the state to offer its protection to one or more of the following vulnerable groups: stateless persons, asylum seekers, or refugees.","key":"asylum","label":"Protection of stateless persons","count":0,"topics":[]},{"keywords":[],"description":"Establishes the right of individuals to practice their culture. May also require the state to protect or promote cultural rights.","key":"cultrght","label":"Right to culture","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination"],"description":"Guarantees that all individuals are entitled to the same privileges and immunities. Prohibits favoritism or discrimination to any group. All are considered to be equal before the law.","key":"equal","label":"General guarantee of equality","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","gender","women's rights"],"description":"Requires that everyone is treated equally before the law, without regard to their gender or sex. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr1","label":"Equality regardless of gender","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","race","ethnicity"],"description":"Requires that everyone is treated equally before the law, without regard to their skin color. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr10","label":"Equality regardless of skin color","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","religion","church","secular"],"description":"Requires that everyone is treated equally before the law, without regard to their creed, belief, or opinions. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr11","label":"Equality regardless of creed or belief","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","class"],"description":"Requires that everyone is treated equally before the law, without regard to their social status or origin. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr12","label":"Equality regardless of social status","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","property"],"description":"Requires that everyone is treated equally before the law, without regard to their financial status or property ownership. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr13","label":"Equality regardless of financial status","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their tribe or clan. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr14","label":"Equality regardless of tribe or clan","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination"],"description":"Requires that everyone is treated equally before the law, without regard to their political party membership or political opinions. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr15","label":"Equality regardless of political party","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their parentage or birth. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr16","label":"Equality regardless of parentage","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their nationality. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr2","label":"Equality regardless of nationality","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","ethnicity","race"],"description":"Requires that everyone is treated equally before the law, without regard to their country or place of origin. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr3","label":"Equality regardless of origin","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","race","ethnicity"],"description":"Requires that everyone is treated equally before the law, without regard to their race. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr4","label":"Equality regardless of race","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","race","ethnicity"],"description":"Requires that everyone is treated equally before the law, without regard to their language. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr5","label":"Equality regardless of language","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","church","secular"],"description":"Requires that everyone is treated equally before the law, without regard to their religion. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr6","label":"Equality regardless of religion","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination"],"description":"Requires that everyone is treated equally before the law, without regard to their sexual orientation. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr7","label":"Equality regardless of sexual orientation","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","children","minors","juveniles"],"description":"Requires that everyone is treated equally before the law, without regard to their age. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr8","label":"Equality regardless of age","count":0,"topics":[]},{"keywords":["anti-discrimination","non-discrimination","disabled"],"description":"Requires that everyone is treated equally before the law, without regard to any disability. This may apply to both public and private interactions in some jurisdictions.","key":"equalgr9","label":"Equality for persons with disabilities","count":0,"topics":[]},{"keywords":[],"description":"Clarifies the citizenship status of members of indigenous groups. In some cases indigenous groups may be granted citizenship in a sub-national unit.","key":"indcit","label":"Citizenship of indigenous groups","count":0,"topics":[]},{"keywords":["suffrage","native","aboriginal"],"description":"Specifically grants indigenous peoples the right to vote in national elections or referenda.","key":"indpolgr1","label":"Indigenous right to vote","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to representation in the central government. This might, for example, involve a seat quota in the legislature.","key":"indpolgr2","label":"Indigenous right to representation","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to form political parties on the basis of group identity.","key":"indpolgr3","label":"Indigenous right to political parties","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples an exemption from taxation by the central government.","key":"indpolgr4","label":"Indigenous right not to pay taxes","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples the right to take part in activities that are illegal for the non-indigenous population.","key":"indpolgr5","label":"Indigenous right to illegal activities","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"Grants indigenous peoples limited rights to self-government, particularly with regard to issues that affect their territory.","key":"indpolgr6","label":"Indigenous right to self governance","count":0,"topics":[]},{"keywords":["family","gender","women's rights"],"description":"Gives both spouses the same rights in marriage and family law. This is a separate issue from the general guarantee of gender equality.","key":"matequal","label":"Provision for matrimonial equality","count":0,"topics":[]},{"keywords":[],"description":"Explains circumstances under which the rights of some individuals or groups may be restricted.","key":"rightres","label":"Restrictions on rights of groups","count":0,"topics":[]},{"keywords":[],"description":"Establishes a group right to self determination. This may be a reference to the nation as a whole, to groups in other countries, or to a portion of the state's population.","key":"selfdet","label":"Right to self determination","count":0,"topics":[]},{"keywords":["class","property"],"description":"Explicit references to social class. This may be in the context of either outlawing or providing for a system of social classes within the state, or in the context of pursuing socio-economic equality.","key":"socclas","label":"Mentions of social class","count":0,"topics":[]},{"keywords":["abortion","contraception","birth control","maternal"],"description":"Grants individuals the right to make decisions about reproduction and family planning. May include provisions about access to contraception, abortion, or other forms of reproductive health care. ","key":"reproduc","label":"Reproductive rights","count":0,"topics":[]},{"keywords":["native","aboriginal"],"description":"","key":"indrghts","label":"Indigenous rights","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_general-duties","label":"General Duties","count":0,"topics":[{"keywords":[],"description":"Requires citizens or public officers to obey the constitution. This primarily applies to individuals in cases where the constitution includes a statement of the duties of citizens or holders of public office.","key":"abide","label":"Duty to obey the constitution","count":0,"topics":[]},{"keywords":[],"description":"Establishes whether or not the rights listed in the constitution are binding on private individuals as well as the state.","key":"binding","label":"Binding effect of const rights","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_legal-procedural-rights","label":"Legal Procedural Rights","count":0,"topics":[{"keywords":["criminal procedure","accused"],"description":"Gives individuals the right to appeal a judicial decision in a higher court if they are not satisfied with the outcome in the court of first instance. Does not necessarily require the appellate court to hear the case, but the mention of an appellate court may imply the power to appeal.","key":"appeal","label":"Right to appeal judicial decisions","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Gives individuals who have been arrested the right to legal counsel. In absence of a right to counsel some constitutions grant only the right to a defense.","key":"couns","label":"Right to counsel","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Prohibits the state from charging an individual with an offense for which they have already been acquitted. This does not necessarily prevent the prosecution from appealing an acquittal.","key":"doubjep","label":"Prohibition of double jeopardy","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Ensures that defendants in criminal trials are entitled to have their cases heard according to the process established by law. This may include specific rights, such as the right to be informed of the charges, the right to counsel, and the right to appeal.","key":"dueproc","label":"Guarantee of due process","count":0,"topics":[]},{"keywords":["search and seizure","criminal procedure","accused"],"description":"Regulates the state's actions with regard to searches and seizures, particularly with regard to criminal investigations. May also prohibit the admission of involuntary confessions, or other suspect forms of evidence.","key":"evidence","label":"Regulation of evidence collection","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Grants an accused offender, and their legal counsel, the right to cross-examine evidence or witnesses brought against them by the prosecution.","key":"examwit","label":"Right to examine evidence/witnesses","count":0,"topics":[]},{"keywords":["refugees","criminal procedure","accused"],"description":"Details the procedure that must be followed for the state to surrender an individual apprehended on its territory to the government of another state for criminal proceedings. Where permitted, this is usually further regulated through bi-lateral treaties.","key":"excrim","label":"Extradition procedure","count":0,"topics":[]},{"keywords":["rule of law","criminal procedure","accused"],"description":"Protects individuals from prosecution for acts that were not criminal at the time that they were committed, or from changes in the penalties for acts.","key":"expost","label":"Protection from ex post facto laws","count":0,"topics":[]},{"keywords":["impartial trial","criminal procedure","accused"],"description":"Protects individuals from unfair procedures. Fair trials often require a public hearing within a reasonable time following the arrest, and judgment by a competent and impartial jury.","key":"fairtri","label":"Right to fair trial","count":0,"topics":[]},{"keywords":["judicial error","criminal procedure","accused"],"description":"Provides redress for individuals who have been confined or arrested without just cause, or have otherwise suffered from judicial error.","key":"falseimp","label":"Protection from false imprisonment","count":0,"topics":[]},{"keywords":["rule of law","habeas corpus","arbitrary detention","arbitrary arrest","criminal procedure","accused"],"description":"Protects individuals from arbitrary detention or improper arrests. Sometimes specified as a right to a writ of habeas corpus.","key":"habcorp","label":"Protection from unjustified restraint","count":0,"topics":[]},{"keywords":["jurors","court assessors","elected assessors","people's assessors","judges-jurors","criminal procedure","accused"],"description":"Grants individuals the right to trial by jury, or more generally provides for citizen participation in the adjudication of guilt in criminal trials.","key":"jury","label":"Jury trials required","count":0,"topics":[]},{"keywords":["family","children","minors","criminal procedure","accused"],"description":"Grants juveniles charged with crimes special protections in the judicial system. This may include special courts, different sentencing rules, or special detention centers.","key":"juvenile","label":"Privileges for juveniles in criminal process","count":0,"topics":[]},{"keywords":["silence","criminal procedure","accused"],"description":"Grants individuals the right to forego answering questions during an interrogation or in court that would tend to confirm the individual's guilt. In some cases an individual may waive this right if they so choose.","key":"miranda","label":"Protection from self-incrimination","count":0,"topics":[]},{"keywords":["bail","criminal procedure","accused"],"description":"Grants individuals who have been arrested and charged with a crime the right to be released from custody until the time of their trial. This may require paying the court a sum of money to be repaid at the time of the trial, or other conditions for release.","key":"prerel","label":"Right to pre-trial release","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Requires that those adjudicating a criminal trial maintain the posture that the accused is \"innocent until proven guilty.\" This places the burden of proof on the side of the prosecution in the trial.","key":"presinoc","label":"Presumption of innocence in trials","count":0,"topics":[]},{"keywords":["public registry","information","criminal procedure","accused"],"description":"Requires that the state produce a public registry of the names of those imprisoned. This often serves as a check on arbitrary or unjust imprisonment.","key":"prisonrg","label":"Prison registry","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Grants individuals charged with an offense the right to have their trial held in public.","key":"pubtri","label":"Right to public trial","count":0,"topics":[]},{"keywords":["reasonable time","criminal procedure","accused"],"description":"Grants individuals charged with an offense the right to be brought to trial without any undue delay.","key":"speedtri","label":"Right to speedy trial","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Grants individuals charged with an offense the right to have their trial conducted in a language they understand, or the right to have an interpreter. In some cases, this would include a right to be informed of the reasons for one’s arrest.","key":"trilang","label":"Trial in native language of accused","count":0,"topics":[]},{"keywords":["criminal procedure","accused"],"description":"Grants the victims of crime rights in the justice process. These rights may include attendance at the trial, an opportunity to speak at the trial, restitution, or other measures to address the needs of crime victims.","key":"vicright","label":"Protection of victim's rights","count":0,"topics":[]},{"keywords":["nulla poena sine lege","rule of law","criminal procedure","accused"],"description":"Protects individuals from being prosecuted for actions that were not crimes at the time they were committed. Similarly, the sentence imposed cannot be greater than the one that was mandated at the time that the crime was committed.","key":"wolaw","label":"Principle of no punishment without law","count":0,"topics":[]},{"keywords":["probable cause"],"description":"Establishes that a jury of citizens must be involved in the process for bringing charges against a suspect. A grand jury determines probable cause, not guilt or innocence.","key":"grjury","label":"Grand jury involved in indictment","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_legal-process","label":"Legal Process","count":0,"topics":[{"keywords":[],"description":"Gives citizens the right to request judicial review of government actions or judgments that they believe have violated their rights.","key":"amparo","label":"Right to amparo","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_physical-integrity-rights","label":"Physical Integrity Rights","count":0,"topics":[{"keywords":[],"description":"Forbids the state from employing the death penalty as a punishment for any crime.","key":"cappun","label":"Prohibition of capital punishment","count":0,"topics":[]},{"keywords":[],"description":"Forbids the state from inflicting physical harm on an offender as a punishment for any crime.","key":"corppun","label":"Prohibition of corporal punishment","count":0,"topics":[]},{"keywords":["inhumane treatment"],"description":"Forbids the state from treating individuals in a way that offends the principle of human dignity. This may include forms of corporal or capital punishment, excessive delays in assessing punishment, or other actions prejudicial to the rights of offenders.","key":"cruelty","label":"Prohibition of cruel treatment","count":0,"topics":[]},{"keywords":[],"description":"Establishes a right to life. The precise meaning of this provision varies between jurisdictions, and may or may not be a reference to the unborn.","key":"life","label":"Right to life","count":0,"topics":[]},{"keywords":["servitude","forced labor"],"description":"Forbids the practice of owning or otherwise exploiting human beings. May still allow for compulsory labor as a punishment for a crime, and/or compulsory service in the military in time of war.","key":"slave","label":"Prohibition of slavery","count":0,"topics":[]},{"keywords":[],"description":"Forbids the state from torturing individuals, and in some cases from using coerced statements in court. This prohibition may be limited in cases of war or other circumstances.","key":"torture","label":"Prohibition of torture","count":0,"topics":[]}]},{"keywords":[],"description":"","key":"rights-and-duties_social-rights","label":"Social Rights","count":0,"topics":[{"keywords":[],"description":"Guarantees individuals equal access to higher education. In some cases this may be limited on a competitive basis, or by tests of aptitude.","key":"achighed","label":"Access to higher education","count":0,"topics":[]},{"keywords":["minors","juveniles","labor","work"],"description":"Protects children against exploitation in the workplace. This may be in the form of a ban on child workers, or as a requirement for additional protections for child workers.","key":"childwrk","label":"Limits on employment of children","count":0,"topics":[]},{"keywords":[],"description":"Addresses consumer rights or consumer protection. Protects consumers from harmful products and/or predatory or unethical business practices.","key":"conright","label":"Protection of consumers","count":0,"topics":[]},{"keywords":["children","minors","juveniles"],"description":"Requires children to attend school. This may be a requirement up to a certain age, or to a certain level of educational attainment.","key":"edcomp","label":"Compulsory education","count":0,"topics":[]},{"keywords":["children","minors","juveniles"],"description":"Requires the state to provide education free of charge. This may be limited at a certain age or level of educational attainment.","key":"edfree","label":"Free education","count":0,"topics":[]},{"keywords":[],"description":"Imposes a duty on the state or on the people to protect or conserve the environment. This may also accord to citizens the right to enjoy a healthy environment.","key":"env","label":"Protection of environment","count":0,"topics":[]},{"keywords":["social security"],"description":"Obligates the state to provide financial or material resources to elderly persons.","key":"finsup1","label":"State support for the elderly","count":0,"topics":[]},{"keywords":["social security"],"description":"Obligates the state to provide financial or material resources to unemployed persons.","key":"finsup2","label":"State support for the unemployed","count":0,"topics":[]},{"keywords":["social security"],"description":"Obligates the state to provide financial or material resources to persons with disabilities.","key":"finsup3","label":"State support for the disabled","count":0,"topics":[]},{"keywords":["social security","minors","juveniles"],"description":"Obligates the state to provide financial or material resources to children.","key":"finsup4","label":"State support for children","count":0,"topics":[]},{"keywords":[],"description":"Obligates the state to provide health care to its citizens, or provides individuals with the general right to health care. In some cases, health care must be provided by the government free of charge.","key":"health","label":"Right to health care","count":0,"topics":[]},{"keywords":["labor"],"description":"Grants individuals the right to form and join trade unions or professional associations. This is an explicit right that goes beyond freedom of association.","key":"jointrde","label":"Right to join trade unions","count":0,"topics":[]},{"keywords":["labor","vacation","holidays","working hours"],"description":"Grants individuals the right to vacations, weekly holidays, and/or annual paid vacation. May be provided via regulation of working hours.","key":"leisure","label":"Right to rest and leisure","count":0,"topics":[]},{"keywords":["labor"],"description":"Gives citizens a general right to work, and/or obligates the state to provide work. This is distinct from the right to choose one's occupation.","key":"provwork","label":"Right to work","count":0,"topics":[]},{"keywords":["remuneration","salary","compensation","labor","wage","equal pay"],"description":"Grants individuals the right to just remuneration or fair/equal payment for work. May also regulate wages including the establishment of a minimum or living wage. ","key":"remuner","label":"Right to just remuneration","count":0,"topics":[]},{"keywords":["labor"],"description":"Grants individuals the right to work in environments free of preventable hazards. This may include an obligation on the state to provide safe working conditions, or to address violations thereof.","key":"safework","label":"Right to safe work environment","count":0,"topics":[]},{"keywords":[],"description":"Accords individuals the right to enjoy the benefits of scientific progress, or obligates the state to promote scientific advancement for the benefit of society.","key":"scifree","label":"Right to enjoy the benefits of science","count":0,"topics":[]},{"keywords":["social security"],"description":"Grants individuals the right to adequate shelter or housing. Often framed in terms of facilitating family life.","key":"shelter","label":"Right to shelter","count":0,"topics":[]},{"keywords":["social security","remuneration","salary","compensation","wage"],"description":"Grants individuals the right to a standard of living that sustains human dignity. May also refer to adequate well-being, suitable existence, or life worthy of a human being.","key":"standliv","label":"Right to reasonable standard of living","count":0,"topics":[]},{"keywords":["trade unions","labor"],"description":"Grants individuals and groups the right to cease work for a period of time, in an effort to exert pressure on their employer. This may or may not include protection for the jobs of strikers.","key":"strike","label":"Right to strike","count":0,"topics":[]},{"keywords":["health","drinking","potable"],"description":"Grants individuals the right to water. May include a guarantee of safe, clean, or potable drinking water. Often associated with a state duty to provide or protect water as a resource.","key":"water","label":"Right to water","count":0,"topics":[]},{"keywords":["school","children","minors","juveniles"],"description":"Provisions regulating access to education. May provide equal access to education or ensure choice of educational institution.","key":"edaccess","label":"Access to education","count":0,"topics":[]},{"keywords":["abortion","contraception","birth control","maternal"],"description":"Grants individuals the right to make decisions about reproduction and family planning. May include provisions about access to contraception, abortion, or other forms of reproductive health care. ","key":"reproduc","label":"Reproductive rights","count":0,"topics":[]},{"keywords":["labor","work"],"description":"Protects women against exploitation in the workplace. May regulate working hours for women or provide other protections.","key":"wmnwork","label":"Limits on employment of women","count":0,"topics":[]}]}]},{"keywords":[],"description":"","key":"special-sections","label":"Special Sections","count":0,"topics":[{"keywords":[],"description":"An introductory section which may or may not be considered an enforceable part of the constitution.","key":"preamble","label":"Preamble","count":0,"topics":[]},{"keywords":[],"description":"Temporary sections of the constitution that guide the transition into the current constitutional order.","key":"tranprov","label":"Transitional provisions","count":0,"topics":[]}]}]